cases/subsonic/Lambert/J10_kernelStudy/b_3Dinj/setup/constant/species/N2
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/species";
    object      N2;
}

specie
{
    nMoles      1;
    molWeight   28.0134;
}

thermodynamics
{
    Cp          1040;
    Hf          0;
}

transport
{
    mu          1.8e-05;
    Pr          0.7;
}