cases/subsonic/Lambert/J10_kernelStudy/b_3Dinj/setup/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// k = 1.5*(U_inf*Tu)^2 con Tu=5%
// k = 1.5*(112*0.05)^2 = 1.5*31.36 = 47.0 m^2/s^2
//

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 47.0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 47.0;
    }

    outletRight
    {
        type            inletOutlet;
        inletValue      uniform 47.0;
        value           uniform 47.0;
    }

    wallTop
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    wallBottom
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    front
    {
        type            symmetry;
    }

    back
    {
        type            symmetry;
    }
}

// ************************************************************************* //
